// Опис класу має такий формат:
class name // name – ім’я класу
{
private: /*  Ім’я секції. Опис закритих членів і методів
класу. Дані і методи будуть доступні лише методам цього
класу */

protected: /*  Ім’я секції. Опис захищених членів і
методів класу. Дані і методи будуть доступні методам  */

public:  /* Ім’я секції. Опис відкритих членів і методів
класу. Дані і методи будуть доступні методам усіх класів
*/
};

int main ()
{
name.p1;  //Звернення до поля p1 екземпляра класу name
name.f1(par1,par2,…parn); // Звернення до методу f1 екземпляра класу name
// par1 і т.д. --- формальні параметри ф-ї f1
}
