---
pdf-engine: xelatex
header-includes:
- \input{$UNI/.templates/settings/preamble.tex}
- \input{$UNI/.templates/settings/minted_settings.tex}
- \newcommand\Type{\Lab}
- \Work{nets}
- \renewcommand\Variant{5}
- \newcommand\Date{11.\the\month.\the\year}
- \newcommand\Number{4}
- \newcommand\Topic{Встановлення консольного з’єднання з комутатором. Налаштування базової конфігурації комутатора}
---

\input{$UNI/.templates/parts/header.tex}
Освоїти принципи конфігурування комутатора на прикладі комутатора Cisco 2960.

# Порядок виконання роботи

1. Створіть конфігурацію мережі та встановіть зв’язок з комутатором через програму
HyperTerminal рис.8.5, використовуючи для з'єднання консольний кабель.

**На ПК запустіть програму HyperTerminal з такими параметрами:**

```
Bits Per Second = 9600
Data Bits = 8
Parity = None
Stop Bits = 1
Flow Control = None
```

Я просто використав роутер Cisco c3725 у GNS3 як роутер EtherSwitch,
тобто фактично він виконує функцію комутатора.

```sh
***************************************************************
This is a normal Router with a Switch module inside (NM-16ESW)
It has been pre-configured with hard-coded speed and duplex

To create vlans use the command "vlan database" in exec mode
After creating all desired vlans use "exit" to apply the config

To view existing vlans use the command "show vlan-switch brief"

Alias(exec)     : vl   - "show vlan-switch brief" command
Alias(configure): va X - macro to add vlan X
Alias(configure): vd X - macro to delete vlan X
***************************************************************
```

2. Включення комутатора.
	a) Підключіть шнур живлення до комутатора Cisco 2960 і електричної
	   розетки, щоб включити комутатор.
	b) Слідкуйте за повідомленнями, які виводяться під час запуску у вікні
	   програми емуляції терміналу. Під час появи повідомлень не натискайте
	   жодних клавіш на клавіатурі. Натискання клавіші перериває процес
	   запуску комутатора. У відображуваних повідомленнях запуску
	   вказується обсяг флеш-пам'яті на комутаторі, версія операційної
	   системи Cisco IOS та інша інформація.
3. Видалення початкової конфігурації та перезавантаження комутатора.
	a) Перейдіть в привілейований режим EXEC, ввівши команду enable. Якщо
	   отримаєте запит на введення паролю, введіть class.
	```
	Switch> enable
	```

	b) Видаліть інформаційний файл бази даних віртуальної локальної мережі.

	```
	Switch# delete flash: vlan.dat
	Delete filename [vlan.dat]? [Enter]
	Delete flash: vlan.dat? [confirm] [Enter]
	```

	c) За відсутності файлу віртуальної локальної мережі відображається
	   повідомлення:

	```
	% Error deleting flash: vlan. dat (No such file or directory)
	```

	```sh
ESW1#delete flash:vlan.dat
Delete filename [vlan.dat]?
Delete flash:vlan.dat? [confirm]
%Error deleting flash:vlan.dat (File not found)
	```

	d) Видаліть файл початкової конфігурації комутатора з NVRAM.

	```
	Switch# erase startup-config
	Після цього з'явиться повідомлення:
	Erasing the nvram filesystem will remove all files! Continue? [confirm]
	Для підтвердження натисніть клавішу Enter. Послідує наступне повідомлення:
	Erase of nvram: complete
	```

	```sh
ESW1#erase startup-config
Erasing the nvram filesystem will remove all configuration files! Continue? [confirm]
[OK]
Erase of nvram: complete
ESW1#
*Mar  1 00:19:50.583: %SYS-7-NV_BLOCK_INIT: Initialized the geometry of nvram
	```

	e) Перезавантажте програмне забезпечення, ввівши команду reload в привілейованому режимі

	```
	EXEC.
	Switch#reload
	```

	```sh
ESW1#reload
Proceed with reload? [confirm]
!!! WARNING - VM is not running, will be unresponsive (status=1) !!!
	```

4. Налаштування імені вузла комутатора. Задайте ім'я вузла комутатора CustomerSwitch, використовуючи команди:

	```
	Switch> enable
	Switch# configure terminal
	Switch(config)# hostname CustomerSwitch
	```

	```sh
ESW1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
ESW1(config)#host
ESW1(config)#hostname Cu
ESW1(config)#hostname CustomerSwitch
CustomerSwitch(config)#
	```

5. Налаштування паролю і секретного паролю в привілейованому режимі:
	a) в режимі глобальної конфігурації задайте в якості значення паролю cisco:

	```
	CustomerSwitch(config)# enable password cisco
	```

	b) в режимі глобальної конфігурації задайте в якості значення таємного паролю cisco123:

	```
	CustomerSwitch(config)# enable secret cisco123
	```

	```sh
CustomerSwitch(config)#enable password cisco
CustomerSwitch(config)#enable secret cisco123
	```

6. Налаштування паролю консолі.
	a) в режимі глобальної конфігурації переключіться в режим налаштування лінії консолі:

	```
	CustomerSwitch (config)# line console 0
	CustomerSwitch (config-line)#
	```

	b) в режимі налаштування лінії задайте пароль cisco і вкажіть умову
	   вводу паролю при кожному вході в систему:

	```
	CustomerSwitch (config-line)# password cisco
	CustomerSwitch (config-line)# login
	CustomerSwitch (config-line)# exit
	```

	```sh
CustomerSwitch(config)#lin
CustomerSwitch(config)#line cons
CustomerSwitch(config)#line console 0
CustomerSwitch(config-line)#pass
CustomerSwitch(config-line)#password cisco
CustomerSwitch(config-line)#login
CustomerSwitch(config-line)#exit
	```

7. Налаштування паролю vty.
	a) в режимі глобальної конфігурації переключіться в режим налаштування для ліній vty з 0 до 15:

	```
	CustomerSwitch (config)# line vty 0 15
	CustomerSwitch (config-line)#
	```

	```sh
CustomerSwitch(config)#line vty 0 15
CustomerSwitch(config-line)#
	```

	b) в режимі налаштування лінії задайте пароль cisco і вкажіть умову вводу паролю при кожному
вході в систему:

	```
	CustomerSwitch (config-line)# password cisco
	CustomerSwitch (config-line)# login
	CustomerSwitch (config-line)# exit
	```

	```sh
CustomerSwitch(config-line)#password cisco
CustomerSwitch(config-line)#login
CustomerSwitch(config-line)#exit
CustomerSwitch(config)#
	```

8. Налаштування IP-адреси для інтерфейсу VLAN1.
	a) в режимі глобальної конфігурації переключіться в режим налаштування
	   інтерфейсу для VLAN1 і призначте IP-адресу 192.168.1.5 з маскою
	   підмережі 255.255.255.0:

	```
	CustomerSwitch (config)# interface VLAN1
	CustomerSwitch (config-if)# ip address 192.168.1.5 255.255.255.0
	CustomerSwitch (config-if)# no shutdown
	CustomerSwitch (config-if)# exit
	```

	```sh
CustomerSwitch(config)#int vlan1
CustomerSwitch(config-if)#ip add 192.168.1.5 255.255.255.0
CustomerSwitch(config-if)#no shut
CustomerSwitch(config-if)#exit
CustomerSwitch(config)#
*Mar  1 00:10:18.683: %LINK-3-UPDOWN: Interface Vlan1, changed state to up
CustomerSwitch(config)#
	```

9. Налаштування шлюзу по замовчуванню.
	a) в режимі глобальної конфігурації призначте шлюзу по замовчуванню
	   адресу 192.168.1.1:

	```
	CustomerSwitch (config)# ip default-gateway 192.168.1.1
	```

	```sh
CustomerSwitch(config)#ip default-gateway 192.168.1.1
CustomerSwitch(config)#
	```

10. Налаштування параметрів порту комутатора:

	```
	CustomerSwitch (config)# interface fastEthernet 0/1
	CustomerSwitch (config-if)# duplex full
	CustomerSwitch (config-if)# speed 100
	CustomerSwitch (config-if)#
	```

	```sh
CustomerSwitch(config)#int fa0/1
CustomerSwitch(config-if)#dup
CustomerSwitch(config-if)#duplex full
CustomerSwitch(config-if)#speed 100
CustomerSwitch(config-if)#
CustomerSwitch(config-if)#end
CustomerSwitch#
*Mar  1 00:11:38.671: %SYS-5-CONFIG_I: Configured from console by console
	```

11. Перевірка конфігурації комутатора.
Введіть команду show running-config, щоб перевірити налаштування IP-адреси комутатора.

```
CustomerSwitch# show running-config
Building configuration...
Current configuration : 1283 bytes
!
version 12,2
no service pad
hostname CustomerSwitch
!
enable secret 5 $1$XUe/$ch4WQ/SpcFCDd2iqd9bda/
enable password cisco
!
interface FastEthernet0/1
!
interface FastEthernet0/24
!
interface Vlan1
ip address 192.168.1.5 255.255.255.0
no ip route-cache
!
ip default-gateway 192.168.1.1
ip http server
!
line con 0
password cisco123
login
line vty 0 4
password cisco123
login
line vty 5 15
password cisco123
login
! end
```

```sh
CustomerSwitch#sh running-config
Building configuration...
Current configuration : 3774 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
no service dhcp
!
hostname CustomerSwitch
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$V3f2$68wMoXlpk4pFPJ6z46w2U/
enable password cisco
!
no aaa new-model
memory-size iomem 5
no ip routing
no ip icmp rate-limit unreachable
no ip cef
!
```

12. Збереження текучої конфігурації.
```
CustomerSwitch# copy running-config startup-config
```

```sh
CustomerSwitch#wr
Building configuration...
[OK]
```

# Висновок

Я навчився працювати з інтерфейсом командного рядка комутатора Cisco.

# Відповіді на контрольні запитання

1) На якому рівні працює комутатор та які основні функції він виконує? L2, він організовує з'єднання багатьох пристроїв.
2) Які базові налаштування задаються при конфігуруванні комутатора? Паролі на доступ різними методами, параметри портів тощо.
3) Про що інформують LED на передній панелі комутатора? Активність портів.
4) Які відмінності між командами enable secret class та enable password class? Secret зашифрований, password зберігається як простий текст у конфігураційному файлі.
5) Яка команда відображає в консолі конфігурацію комутатора? sh running-config
6) Чим відрізняються комутатори другого та третього рівнів? Комутатор 3-го рівня має функціонал роутера крім комутатора.
